{
  "architectures": [
    "ViTModel"
  ],
  "attention_probs_dropout_prob": 0.1,
  "dtype": "float32",
  "encoder_stride": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 32,
  "image_size": 30,
  "initializer_range": 0.02,
  "intermediate_size": 37,
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 4,
  "num_channels": 3,
  "num_hidden_layers": 5,
  "patch_size": 2,
  "pooler_act": "tanh",
  "pooler_output_size": 32,
  "qkv_bias": true,
  "transformers_version": "5.3.0"
}
